ERP.belugaerp/src/Documents/ДвижениеПродукцииИМатериалов/ДвижениеПродукцииИМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДвижениеПродукцииИМатериалов</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>бг_СписаниеПотерь</name>
    <type>
      <types>DocumentRef.битСписаниеПотерь</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностям</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_ДанныеФСМ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Разряд</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДиапазона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецДиапазона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/InformationRegisters/бг_КратностьНоменклатуры/бг_КратностьНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_КратностьНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Documents/ДвижениеПродукцииИМатериалов/Forms/бг_УстановкаКоличества/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Данные") Тогда
		ЗаполнитьФорму(Параметры.Данные);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	Параметры.Свойство("Период", Период);
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры
	
#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Модифицированность = Ложь;
	ВыбранныеПозиции = Новый Массив;
	Для каждого СтрокаТовары Из Товары.НайтиСтроки(Новый Структура("ПереноситьВДокумент", Истина)) Цикл
		НоваяСтрока = Новый Структура("Номенклатура, Количество");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
		ВыбранныеПозиции.Добавить(НоваяСтрока);
	КонецЦикла;
	ЗапомнитьКратностьНаСервере();
	Закрыть(ПоместитьВХранилище(ВыбранныеПозиции));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Команда)
	УстановитьОтметку(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	УстановитьОтметку(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКратность(Команда)
	ЗаполнитьКратносьРассчитатьКоличествоСервер();
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТоварыКратностьПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Кратность = 0 Тогда
		ТекущиеДанные.Кратность = 1; 
		ТекущиеДанные.ЗапоминатьКратность = Ложь;
	Иначе
		ТекущиеДанные.ЗапоминатьКратность = Истина;
	КонецЕсли;
	
	РассчитатьНовоеКоличество(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные.ПереноситьВДокумент = Истина;
	ТекущиеДанные.ЗапоминатьКратность = Ложь;
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьНовоеКоличество(СтрокаТовары)
	Если СтрокаТовары.Кратность = 0 Тогда
		СтрокаТовары.Кратность = 1; 
	КонецЕсли;
	Если Цел(СтрокаТовары.КоличествоИсточник / СтрокаТовары.Кратность) 
		= СтрокаТовары.КоличествоИсточник / СтрокаТовары.Кратность Тогда
		СтрокаТовары.Количество = СтрокаТовары.КоличествоИсточник;
	Иначе
		СтрокаТовары.Количество = (Цел(СтрокаТовары.КоличествоИсточник / СтрокаТовары.Кратность) + 1)
				* СтрокаТовары.Кратность;
	КонецЕсли;
	СтрокаТовары.ПереноситьВДокумент = Истина;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьКратносьРассчитатьКоличествоСервер()
	Номенклатура = Товары.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");
	ТаблицаКратности = РегистрыСведений.бг_КратностьНоменклатуры.КратностьНоменклатуры(Период, Номенклатура);
	Для каждого СтрокаТовары Из Товары Цикл
		СтрокаКратность = ТаблицаКратности.Найти(СтрокаТовары.Номенклатура, "Номенклатура");
		Если Не СтрокаКратность = Неопределено И Не СтрокаКратность.Кратность = 0 Тогда
			СтрокаТовары.Кратность = СтрокаКратность.Кратность;
			СтрокаТовары.ЗапоминатьКратность = Ложь;
			РассчитатьНовоеКоличество(СтрокаТовары);
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаСервере
Функция ПоместитьВХранилище(ВыбранныеПозиции)
	
	Возврат ПоместитьВоВременноеХранилище(ВыбранныеПозиции);
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтметку(Отметка)
	Для каждого Идентификатор Из Элементы.Товары.ВыделенныеСтроки Цикл
		СтрокаТовары = Товары.НайтиПоИдентификатору(Идентификатор);
		СтрокаТовары.ПереноситьВДокумент = Отметка;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму(ДанныеЗаполнения)
	Товары.Очистить();
	ТоварыДляЗаполнения = Товары.Выгрузить();
	Для каждого СтрокаДанные Из ДанныеЗаполнения Цикл
		НоваяСтрока = ТоварыДляЗаполнения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанные);
		НоваяСтрока.КоличествоИсточник = НоваяСтрока.Количество;
		НоваяСтрока.Кратность = 1;
	КонецЦикла;
	ТоварыДляЗаполнения.Свернуть("Номенклатура, Кратность", "Количество, КоличествоИсточник");
	Товары.Сортировать("Номенклатура");
	Товары.Загрузить(ТоварыДляЗаполнения);
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьКратностьНаСервере()
	СтруктураОтбора = Новый Структура("ЗапоминатьКратность, ПереноситьВДокумент", Истина, Истина);
	ТаблицаКратности = Товары.Выгрузить(СтруктураОтбора, "Номенклатура, Кратность");
	РегистрыСведений.бг_КратностьНоменклатуры.ЗапомнитьКратность(Период, ТаблицаКратности);
КонецПроцедуры

#КонецОбласти
